# Work fun
tap "d12frosted/emacs-plus" ; brew "emacs-plus"
cask "blue-jeans-launcher"
cask "docker" # docker docker
cask "hipchat" # Work chat
cask "slack" # Work/fun chat
cask "tunnelblick" # Work vpn
cask "virtualbox" # vms
cask "vagrant" # all the vms
brew "git" # Newer than what brew installs
brew "gnupg" # Crypto, not currency
brew "pinentry-mac" # gpg card pin entry
brew "htop" # L33t
brew "hub" # git, for github
brew "ncdu" # Find big files
brew "neovim" # Edit stuff
brew "ripgrep" # Faster grep/ack/ag
brew "socat" # Better netcat
brew "tmux" # Terminal thingy
brew "reattach-to-user-namespace" # For tmux
brew "unrar" # Rar happens
brew "unzip" # Zip happens
brew "nmap" # Port scanner
brew "p0f" # Passive scanner
cask "minikube" # k8s in a box

# Mac fun
cask "aerial" # Screensaver
cask "alfred" # Launcher
tap "crisidev/chunkwm" ; brew "chunkwm" # Window manager
tap "koekeishiya/formulae" ; brew "khd" # Keyboard shortcuts
cask "cathode" # Silly terminal
cask "ubersicht" # UI bar
cask "font-hack" # I don't think I use this any more
cask "font-liberation-mono-for-powerline" # For neovim

# Game fun
cask "angband" # Morgoth
cask "brogue" # Less goth
cask "steam" # Meta game

# Life fun
cask "1password" # Family accounts
cask "adobe-creative-cloud" # Family pictures
brew "ddrescue" # Photo recover
brew "exiftool" # Photo munge
brew "imagemagick" # manipulation
cask "arq" # Family backups
cask "discord" # Friend chat
cask "dropbox" # File sync
cask "onedrive" # File sync
cask "little-snitch" # Personal egress filtering
cask "vlc" # Music videos
brew "youtube-dl" # Music videos
cask "zerotier-one" # Personal network
# cask microsoft-office # Not 365 apparently

# Browsers
cask "brave" # For bt
cask "firefox" # Personal browsing
cask "firefoxnightly" # Work browsing
cask "multifirefox" # Profile manager
cask "google-chrome" # Flash/music
