# Work fun
#tap "d12frosted/emacs-plus" ; brew "emacs-plus"
#cask "docker" # docker docker
brew "podman" # yeah
cask "podman-desktop" # manages the podman status
brew "podman-compose" # not docker compose
cask "virtualbox" # vms - reboot and approve kernel extension
brew "git" # Newer than what brew installs
brew "gnupg" # Crypto, not currency
brew "pinentry-mac" # gpg card pin entry
brew "htop" # L33t
brew "hub" # git, for github
brew "ncdu" # Find big files
brew "neovim" # Edit stuff. Then `curl -fLo ~/.local/share/nvim/site/autoload/plug.vim --create-dirs https://raw.githubusercontent.com/junegunn/vim-plug/master/plug.vim`
brew "ripgrep" # Faster grep/ack/ag
brew "socat" # Better netcat
#cask "iterm2" # Terminal emulator
brew "tmux" # Terminal thingy
brew "reattach-to-user-namespace" # For tmux
brew "unrar" # Rar happens
brew "unzip" # Zip happens
brew "nmap" # Port scanner
brew "p0f" # Passive scanner
tap "homebrew/cask-versions" # For FF dev
#cask "jetbrains-toolbox" # other dev tools
#cask "visual-studio-code" # frontend dev
brew "cmake" # always useful, but what was it for?
brew "bat" # better cat
brew "fzf" # better shell search
brew "dua" # better du
brew "fd" # better find
brew "jq" # tooling
brew "fontconfig" # for doom-emacs
brew "shellcheck" # for doom-emacs
brew "discount" # for doom-emacs
#brew tap railwaycat/emacsmacport ; brew install "emacs-mac@28" --with-native-comp --with-modules # doom-emacs
#cask "talon" # voice control

# Mac fun
#cask "aerial" # Screensaver
cask "alfred" # Launcher
#tap "koekeishiya/formulae" ; brew "chunkwm" # Window manager
#brew "skhd" # Keyboard shortcuts
cask "amethyst" # combination window manager and keyboard shortcus
brew "sketchybar" # status bar that works well with amethyst
#cask "cathode" # Silly terminal
cask "ubersicht" # UI bar
tap "homebrew/cask-fonts" # For fonts
#cask "font-hack" # I don't think I use this any more
#cask "font-liberation-mono-for-powerline" # For neovim
cask "font-liberation-nerd-font" # for everything
cask "font-jetbrains-nerd-font" # might I like this more?

# Game fun
#cask "angband" # Morgoth
#cask "brogue" # Less goth
#cask "steam" # Meta game
#cask "itch" # meta indy game
#brew "cataclysm" # zombie game

# Life fun
cask "1password" # Family accounts
#cask "adobe-creative-cloud" # Family pictures. Run /usr/local/Caskroom/adobe-creative-cloud/latest/Creative Cloud Installer.app
#cask "microsoft-office" # OneNote, word, outlook, etc.
#brew "ddrescue" # Photo recover
#brew "exiftool" # Photo munge
#brew "imagemagick" # manipulation
cask "arq" # Family backups
#cask "discord" # Friend chat
cask "dropbox" # File sync
cask "onedrive" # File sync
#cask "little-snitch" # Personal egress filtering
#cask "vlc" # Music videos
#brew "ffmpeg" # better music videos
#brew "handbrake" # dvds?
#brew "libdvdcss" # dvds!?
#cask "makemkv" # mkvs?
# gem install video_transcoding # mkvs!?
#cask "zerotier-one" # Personal network - reboot and approve kernel extension

# Browsers
#cask "brave" # For bt
#cask "firefox" # Personal browsing
#cask "firefox-nightly" # Work browsing
cask "choosy" # Browser choosing
#cask "multifirefox" # Profile manager
#cask "google-chrome" # Flash/music
