# Work fun
tap "d12frosted/emacs-plus" ; brew "emacs-plus"
cask "blue-jeans" # Need /usr/local/Caskroom/blue-jeans/2.7.0.450/BlueJeansInstaller.app
cask "docker" # docker docker
cask "slack" # Work/fun chat
cask "tunnelblick" # Work vpn
cask "virtualbox" # vms - reboot and approve kernel extension
cask "vagrant" # all the vms
brew "git" # Newer than what brew installs
brew "gnupg" # Crypto, not currency
brew "pinentry-mac" # gpg card pin entry
brew "htop" # L33t
brew "hub" # git, for github
brew "ncdu" # Find big files
brew "neovim" # Edit stuff. Then `curl -fLo ~/.local/share/nvim/site/autoload/plug.vim --create-dirs https://raw.githubusercontent.com/junegunn/vim-plug/master/plug.vim`
brew "ripgrep" # Faster grep/ack/ag
brew "socat" # Better netcat
cask "iterm2" # Terminal emulator
cask "serial" # Serial terminal emulator
brew "tmux" # Terminal thingy
brew "reattach-to-user-namespace" # For tmux
brew "unrar" # Rar happens
brew "unzip" # Zip happens
brew "nmap" # Port scanner
brew "p0f" # Passive scanner
cask "minikube" # k8s in a box
brew "node@8" # LTS major version; 10 after oct 2018
brew "yarn" # node stuff
brew "stow" # node stuff?
brew "hugo" # node stuff?
tap "homebrew/cask-versions" # For FF Nightly and java8
cask "java8" # jdk 8
cask "intellij-idea" # java dev
cask "jetbrains-toolbox" # other dev tools
brew "maven" # java package management
#cask "visual-studio-code" # frontend dev
brew "pyenv" # rbenv for py
brew "pyenv-virtualenv" # rbenv for pyenv?
cask "google-cloud-sdk" #gcloud suite
brew "bat" # better cat
brew "emacs-mac" # doom-emacs
cask "talon" # voice control

# Mac fun
cask "aerial" # Screensaver
cask "alfred" # Launcher
#tap "koekeishiya/formulae" ; brew "chunkwm" # Window manager
#brew "skhd" # Keyboard shortcuts
cask "amethyst" # combination window manager and keyboard shortcus
cask "cathode" # Silly terminal
cask "ubersicht" # UI bar
tap "homebrew/cask-fonts" # For fonts
cask "font-hack" # I don't think I use this any more
cask "font-liberation-mono-for-powerline" # For neovim

# Game fun
cask "angband" # Morgoth
cask "brogue" # Less goth
cask "steam" # Meta game
cask "itch" # meta indy game
brew "cataclysm" # zombie game

# Life fun
cask "1password" # Family accounts
cask "adobe-creative-cloud" # Family pictures. Run /usr/local/Caskroom/adobe-creative-cloud/latest/Creative Cloud Installer.app
cask "microsoft-office" # OneNote, word, outlook, etc.
brew "ddrescue" # Photo recover
brew "exiftool" # Photo munge
brew "imagemagick" # manipulation
cask "arq" # Family backups
cask "discord" # Friend chat
cask "dropbox" # File sync
cask "onedrive" # File sync
cask "little-snitch" # Personal egress filtering
cask "vlc" # Music videos
brew "youtube-dl" # Music videos
brew "ffmpeg" # better music videos
brew "handbrake" # dvds?
brew "libdvdcss" # dvds!?
cask "makemkv" # mkvs?
# gem install video_transcoding # mkvs!?
cask "zerotier-one" # Personal network - reboot and approve kernel extension

# Browsers
cask "brave" # For bt
cask "firefox" # Personal browsing
cask "firefox-nightly" # Work browsing
cask "choosy" # Browser choosing
cask "multifirefox" # Profile manager
cask "google-chrome" # Flash/music
